In [1]:
import seaborn as sns
import numpy as np
import pandas as pd
np.random.seed(42)

In [2]:
df = pd.DataFrame(np.random.randint(0,100, size=(7,5)), columns=['x1','x2','x3','x4','x5'])
df

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32
5  75  57  21  88  48
6  90  58  41  91  59

In [3]:
df.count()

x1    7
x2    7
x3    7
x4    7
x5    7
dtype: int64

In [4]:
df.x1.count(), df.x2.count(),df.x3.count()

(7, 7, 7)

In [11]:
df.mean()

x1    53.714286
x2    64.571429
x3    47.285714
x4    53.571429
x5    47.285714
dtype: float64

In [8]:
df.mean(axis=1)

0    57.6
1    67.2
2    46.4
3    41.2
4    35.0
5    57.8
6    67.8
dtype: float64

In [6]:
df.x1.mean(), df.x2.mean(),df.x3.mean()

(53.714285714285715, 64.57142857142857, 47.285714285714285)

In [7]:
df.median()

x1    52.0
x2    63.0
x3    41.0
x4    71.0
x5    48.0
dtype: float64

In [12]:
df.min()

x1     1
x2     1
x3    14
x4     2
x5    21
dtype: int32

In [14]:
df.x1.min(), df.x2.min(), df.x3.min()

(1, 1, 14)

In [15]:
df

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32
5  75  57  21  88  48
6  90  58  41  91  59

In [16]:
df.idxmin() #minimum un indeksini verir

x1    4
x2    3
x3    0
x4    2
x5    2
dtype: int64

In [17]:
df.x1.idxmin(),df.x2.idxmin(),df.x3.idxmin()

(4, 3, 0)

In [18]:
df.std()

x1    33.673502
x2    32.623392
x3    30.663302
x4    35.818325
x5    18.454577
dtype: float64

In [21]:
df[['x1','x2','x3']].std()

x1    33.673502
x2    32.623392
x3    30.663302
dtype: float64

In [22]:
df.var()

x1    1133.904762
x2    1064.285714
x3     940.238095
x4    1282.952381
x5     340.571429
dtype: float64

In [23]:
df[['x1','x2','x3']].var()

x1    1133.904762
x2    1064.285714
x3     940.238095
dtype: float64

In [24]:
df

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32
5  75  57  21  88  48
6  90  58  41  91  59

In [25]:
gesamt = df.sum(axis=0)
gesamt

x1    376
x2    452
x3    331
x4    375
x5    331
dtype: int64

In [29]:
k = gesamt // 200
k

x1    1
x2    2
x3    1
x4    1
x5    1
dtype: int64

In [30]:
df.head(2)

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74

In [31]:
df.shape, k.shape

((7, 5), (5,))

In [32]:
df.sum(axis=0)

x1    376
x2    452
x3    331
x4    375
x5    331
dtype: int64

In [33]:
df.x1.sum()

376

In [34]:
df.iloc[:,0].sum() # Spalte

376

In [35]:
df.iloc[0] # Zeile

x1    51
x2    92
x3    14
x4    71
x5    60
Name: 0, dtype: int32

In [39]:
def histogram_intersection(a, b):
    v = np.minimum(a, b).sum().round(decimals=1)
    return v
df.corr(method=histogram_intersection)

       x1     x2     x3     x4     x5
x1    1.0  275.0  172.0  268.0  237.0
x2  275.0    1.0  241.0  283.0  294.0
x3  172.0  241.0    1.0  201.0  240.0
x4  268.0  283.0  201.0    1.0  292.0
x5  237.0  294.0  240.0  292.0    1.0

In [40]:
df.corr()  # default-> pearson : standard correlation coefficient

          x1        x2        x3        x4        x5
x1  1.000000  0.041895 -0.564373  0.200385 -0.146551
x2  0.041895  1.000000 -0.562665  0.023779  0.139760
x3 -0.564373 -0.562665  1.000000 -0.158751  0.167712
x4  0.200385  0.023779 -0.158751  1.000000  0.845133
x5 -0.146551  0.139760  0.167712  0.845133  1.000000

In [41]:
df[['x1','x2','x3']].corr()

          x1        x2        x3
x1  1.000000  0.041895 -0.564373
x2  0.041895  1.000000 -0.562665
x3 -0.564373 -0.562665  1.000000

In [42]:
df.x1.corr(df.x2)

0.04189528582574875

In [43]:
df.describe()

              x1         x2         x3         x4         x5
count   7.000000   7.000000   7.000000   7.000000   7.000000
mean   53.714286  64.571429  47.285714  53.571429  47.285714
std    33.673502  32.623392  30.663302  35.818325  18.454577
min     1.000000   1.000000  14.000000   2.000000  21.000000
25%    35.500000  57.500000  22.000000  24.500000  34.500000
50%    52.000000  63.000000  41.000000  71.000000  48.000000
75%    81.000000  87.000000  72.500000  81.000000  59.500000
max    90.000000  99.000000  87.000000  91.000000  74.000000

In [44]:
df.describe().T

    count       mean        std   min   25%   50%   75%   max
x1    7.0  53.714286  33.673502   1.0  35.5  52.0  81.0  90.0
x2    7.0  64.571429  32.623392   1.0  57.5  63.0  87.0  99.0
x3    7.0  47.285714  30.663302  14.0  22.0  41.0  72.5  87.0
x4    7.0  53.571429  35.818325   2.0  24.5  71.0  81.0  91.0
x5    7.0  47.285714  18.454577  21.0  34.5  48.0  59.5  74.0

# Groupby, Aggregiation

In [47]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [49]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [50]:
df[['sepal_length']].describe()

       sepal_length
count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000

In [51]:
df.describe()[['sepal_length']]

       sepal_length
count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000

In [52]:
df.describe().T

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [57]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [58]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [63]:
df.corr()[['sepal_length']]

              sepal_length
sepal_length      1.000000
sepal_width      -0.117570
petal_length      0.871754
petal_width       0.817941

In [64]:
df[['sepal_length']].corr() # mantiksiz kendi kendisi

              sepal_length
sepal_length           1.0

In [68]:
df['petal_length'].corr(df['petal_width'])

0.9628654314027963

In [71]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [72]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [74]:
df['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [77]:
df['species'].value_counts(dropna=False, normalize=True )*100

setosa        33.333333
versicolor    33.333333
virginica     33.333333
Name: species, dtype: float64

In [78]:
df['species'].value_counts(dropna=False)*100

setosa        5000
versicolor    5000
virginica     5000
Name: species, dtype: int64

In [81]:
df['species'].value_counts(dropna=True )*100

setosa        5000
versicolor    5000
virginica     5000
Name: species, dtype: int64

In [ ]:
df['species'].value_counts(dropna=True )*100

In [86]:
df.groupby('species') #Lazy fuunktion

In [87]:
df.groupby('species').mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [88]:
df.groupby('species').median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [89]:
df.mean(numeric_only= True)

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [90]:
df.mean()

C:\Users\bulen\AppData\Local\Temp/ipykernel_7332/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [92]:
df.groupby('species').describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [93]:
df.groupby('species')['sepal_length'].sum()

species
setosa        250.3
versicolor    296.8
virginica     329.4
Name: sepal_length, dtype: float64

In [94]:
df.groupby('species')['sepal_length'].mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

In [95]:
df.groupby('species')[['sepal_length']].sum()

            sepal_length
species
setosa             250.3
versicolor         296.8
virginica          329.4

In [97]:
df.groupby('species')[['sepal_length','sepal_width']].sum()

            sepal_length  sepal_width
species
setosa             250.3        171.4
versicolor         296.8        138.5
virginica          329.4        148.7

In [98]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person' :['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales'  :[200, 120, 340, 124, 243, 350]}

In [102]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [104]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [105]:
df.groupby('Company').median()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [108]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [110]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [111]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [112]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [113]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [114]:
df.groupby('Company').describe().T

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [115]:
df.groupby(['Company', "Person"]).describe()

                Sales
                count   mean std    min    25%    50%    75%    max
Company Person
FB      Carl      1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0
        Sarah     1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0
GOOG    Charlie   1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
        Sam       1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
MSFT    Amy       1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
        Vanessa   1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0

DataFrame / Series Operationen

In [116]:
df_ = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                    'var1'  : [10,23,33,22,11,99,76,84,45],
                    'var2'  : [100,253,333,262,111,969,405,578,760]})
df_

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [119]:
df_.groupby('groups').aggregate('min')

        var1  var2
groups
A         10   100
B         11   111
C         33   333

In [121]:
df_.groupby('groups').aggregate(['min','max'])

       var1     var2
        min max  min  max
groups
A        10  76  100  405
B        11  84  111  578
C        33  99  333  969

In [122]:
df_.groupby('groups').aggregate(['min','max','median'])

       var1            var2
        min max median  min  max median
groups
A        10  76   22.0  100  405  262.0
B        11  84   23.0  111  578  253.0
C        33  99   45.0  333  969  760.0

In [123]:
df_.groupby('groups').aggregate([np.min, np.median, np.max])

       var1             var2
       amin median amax amin median amax
groups
A        10   22.0   76  100  262.0  405
B        11   23.0   84  111  253.0  578
C        33   45.0   99  333  760.0  969

In [124]:
df_.groupby('groups').agg([np.min, "median", max])

       var1            var2
       amin median max amin median  max
groups
A        10   22.0  76  100  262.0  405
B        11   23.0  84  111  253.0  578
C        33   45.0  99  333  760.0  969

In [126]:
df_.groupby('groups').agg({'var1':(min,'max'), 'var2':'median'})

       var1       var2
        min max median
groups
A        10  76  262.0
B        11  84  253.0
C        33  99  760.0

#### .filter()

In [127]:
df_

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [128]:
df_.groups.unique()

array(['A', 'B', 'C'], dtype=object)

In [129]:
df_['groups'].unique()

array(['A', 'B', 'C'], dtype=object)

In [131]:
df_.groupby('groups').mean()

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [133]:
def filter_func(x):
    return x['var1'].mean() >39

df_.groupby('groups').filter(filter_func)

  groups  var1  var2
1      B    23   253
2      C    33   333
4      B    11   111
5      C    99   969
7      B    84   578
8      C    45   760

In [134]:
df_.groupby('groups').sum()

        var1  var2
groups
A        108   767
B        118   942
C        177  2062

In [135]:
df_.groupby('groups').filter(lambda x : x['var2'].sum() <800)

  groups  var1  var2
0      A    10   100
3      A    22   262
6      A    76   405

In [136]:
df_

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

#### .transform()

In [137]:
df_

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [140]:
df_a = df_.iloc[:,1:3]
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [143]:
df_a.transform(lambda x: (x-x.mean())/x.std())

       var1      var2
0 -1.040605 -1.078044
1 -0.651625 -0.560989
2 -0.352409 -0.290633
3 -0.681547 -0.530573
4 -1.010684 -1.040870
5  1.622413  1.858697
6  0.934218 -0.047312
7  1.173590  0.537332
8  0.006649  1.152392

In [144]:
df_a.var1.transform(lambda x : (x-x.mean())/x.std()).head(3)

0   -1.040605
1   -0.651625
2   -0.352409
Name: var1, dtype: float64

#### .apply()


DataFrame.apply()

In [146]:
df_

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [151]:
df_.apply(np.sum)

groups    ABCABCABC
var1            403
var2           3771
dtype: object

In [148]:
df_.sum()

groups    ABCABCABC
var1            403
var2           3771
dtype: object

In [152]:
df_.iloc[:,1:].apply(np.median)

var1     33.0
var2    333.0
dtype: float64

In [154]:
df_.iloc[:,1:].median()

var1     33.0
var2    333.0
dtype: float64

In [155]:
df_a.mean(axis=1)

0     55.0
1    138.0
2    183.0
3    142.0
4     61.0
5    534.0
6    240.5
7    331.0
8    402.5
dtype: float64

In [161]:
# df_a.apply('mean',axis=1)
df_a.apply(np.mean,axis=1)

0    100
1    253
2    333
3    262
4    111
5    969
6    405
7    578
8    760
dtype: int64

In [162]:
df_.groupby('groups').apply(np.mean)

C:\Users\bulen\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [168]:
dd =df_.iloc[:,1:]

In [170]:
df_.groupby('groups').apply(np.mean)

C:\Users\bulen\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [171]:
df_.groupby("groups").mean()

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

#### ``Series.apply()`` &``df["col"].apply()``

In [172]:
df = pd.DataFrame({'col1':[1, 2, 3, 4],
                   'col2':[444, 555, 666, 444],
                   'col3':['abc','def','ghi','xyz']})

df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [173]:
def squared(x):
    return x ** 2

df['col1'].apply(squared)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [174]:
df['col1'].apply(lambda x : x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [177]:
df['col1'].apply(lambda x : x if x<3 else 0)

0    1
1    2
2    0
3    0
Name: col1, dtype: int64

In [179]:
df['col1'].apply(lambda x : 1 if x<2 else 0)

0    1
1    0
2    0
3    0
Name: col1, dtype: int64

In [180]:
df['col1'].apply(lambda x : -x if x<0 else x) # mutlak deger

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [183]:
df['col1'].transform(lambda x : x if x<3 else 0) # mutlak deger

0    1
1    2
2    0
3    0
Name: col1, dtype: int64

In [184]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [185]:
df['col3'].transform(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [186]:
df[["col1", "col2"]].apply(squared) # squared def olarak tanimlandi yukarida

   col1    col2
0     1  197136
1     4  308025
2     9  443556
3    16  197136

In [187]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [190]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [189]:
df.select_dtypes(exclude = 'object').apply(squared)

   col1    col2
0     1  197136
1     4  308025
2     9  443556
3    16  197136

In [191]:
df.apply(len)

col1    4
col2    4
col3    4
dtype: int64

### ``DataFrame.applymap()``
#### ``Series`` ve ``Dict`` lerde ``map()``, 
#### ``DataFrame`` lerde ``applymap()`` kullanilir

In [202]:
df_ = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                    'var1'  : [10,23,33,22,11,99,76,84,45],
                    'var2'  : [100,253,333,262,111,969,405,578,760]})
df_

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [203]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [211]:
df_ = df.iloc[:, :2]
df_

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [197]:
df_.applymap(lambda x : x*5)

   col1  col2
0     5  2220
1    10  2775
2    15  3330
3    20  2220

In [198]:
df_.apply(lambda x : x*5)

   col1  col2
0     5  2220
1    10  2775
2    15  3330
3    20  2220

In [212]:
df_

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [218]:
df_ = df_['col1'].map({1:'A', 2:'B'})
# df_.col1.map({1:"A", 2:"B"})
df_

0      A
1      B
2    NaN
3    NaN
Name: col1, dtype: object

## `df.transform() vs df.apply()`

In [220]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [10, 20, 30]})
df

   A   B
0  1  10
1  2  20
2  3  30

In [221]:
df.apply(lambda x : x +10)

    A   B
0  11  20
1  12  30
2  13  40

In [222]:
df.transform(lambda x : x +10)

    A   B
0  11  20
1  12  30
2  13  40

In [223]:
df['B_apply'] = df['B'].apply(lambda x: x+10)
df['B_trans'] = df['B'].transform(lambda x: x+10)
df

   A   B  B_apply  B_trans
0  1  10       20       20
1  2  20       30       30
2  3  30       40       40

### Unterschiede zwischen ``.apply()`` und ``.transform()`` bei der Manipulation von Daten

In [226]:
df = df[['A','B']]
df

   A   B
0  1  10
1  2  20
2  3  30

In [228]:
df.transform('sqrt')

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226

In [229]:
df.apply('sqrt')

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226

In [230]:
df.apply(np.sqrt)

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226

In [232]:
df.transform([np.sqrt, np.log])

          A                   B
       sqrt       log      sqrt       log
0  1.000000  0.000000  3.162278  2.302585
1  1.414214  0.693147  4.472136  2.995732
2  1.732051  1.098612  5.477226  3.401197

In [233]:
df.apply([np.sqrt, np.log])

          A                   B
       sqrt       log      sqrt       log
0  1.000000  0.000000  3.162278  2.302585
1  1.414214  0.693147  4.472136  2.995732
2  1.732051  1.098612  5.477226  3.401197

In [234]:
df.transform({'A': np.sqrt, 'B': np.log})

          A         B
0  1.000000  2.302585
1  1.414214  2.995732
2  1.732051  3.401197

In [235]:
df.apply({'A': np.sqrt, 'B': np.log})

          A         B
0  1.000000  2.302585
1  1.414214  2.995732
2  1.732051  3.401197

In [236]:
df.apply(lambda x: x.sum())

A     6
B    60
dtype: int64

In [238]:
# df.transform(lambda x: x.sum())

In [239]:
df

   A   B
0  1  10
1  2  20
2  3  30

In [248]:
df.apply(lambda x : x['B'] - x['A'], axis = 1)

0     9
1    18
2    27
dtype: int64

In [242]:
# df.transform(lambda x : x['B'] - x['A'], axis = 1)
# Function did not transform

In [245]:
df

   A   B
0  1  10
1  2  20
2  3  30

In [244]:
df.transform(lambda x : x['B'] - x, axis = 1)

# Function did not transform

    A  B
0   9  0
1  18  0
2  27  0

In [249]:
df = pd.DataFrame({'key': ['a', 'b', 'c'] * 3,
                    'A'  : np.arange(9),
                    'B'  : [1, 2, 3] * 3})
df

  key  A  B
0   a  0  1
1   b  1  2
2   c  2  3
3   a  3  1
4   b  4  2
5   c  5  3
6   a  6  1
7   b  7  2
8   c  8  3

In [250]:
df.groupby('key')[['A']].sum()

      A
key
a     9
b    12
c    15

In [251]:
df.groupby('key').sum()

      A  B
key
a     9  3
b    12  6
c    15  9

In [252]:
df.groupby('key')['A'].apply(lambda x: x.sum())

key
a     9
b    12
c    15
Name: A, dtype: int64

In [255]:
df.groupby('key')['A'].transform('sum')

0     9
1    12
2    15
3     9
4    12
5    15
6     9
7    12
8    15
Name: A, dtype: int32

In [256]:
df.groupby('key')['A'].transform(np.sum)

0     9
1    12
2    15
3     9
4    12
5    15
6     9
7    12
8    15
Name: A, dtype: int32

In [265]:
df.groupby('key')['A'].transform(lambda x: x.sum())

0     9
1    12
2    15
3     9
4    12
5    15
6     9
7    12
8    15
Name: A, dtype: int64

In [267]:
df

  key  A  B
0   a  0  1
1   b  1  2
2   c  2  3
3   a  3  1
4   b  4  2
5   c  5  3
6   a  6  1
7   b  7  2
8   c  8  3

In [276]:
df_ =df.iloc[:,1:]
# df.groupby('key').apply(lambda x: x["B"]-x["A"])
# df_.groupby('key').transform(lambda x: x["B"]-x["A"]) #gibt einen Fehler

# print(df_)
df_.transform(lambda x : x['B'] - x, axis = 1)

   A  B
0  1  0
1  1  0
2  1  0
3 -2  0
4 -2  0
5 -2  0
6 -5  0
7 -5  0
8 -5  0

In [277]:
df.groupby('key').apply(lambda x: x['B']-x['A'])

key
a    0    1
     3   -2
     6   -5
b    1    1
     4   -2
     7   -5
c    2    1
     5   -2
     8   -5
dtype: int64

# ``pivot()`` vs ``pivot_table()``

In [279]:
data = {'gender':['male', 'female', 'female', 'male', 'female', 'male'],
        'sport' :['tennis', 'tennis', 'basketball', 'football', 'voleyball', 'basketball'],
        'age'   :[20, 24, 26, 23, 22, 21],
        'height':[185, 172, 175, 178, 182, 196],
        'weight':[83, 58, 62, 80, 65, 90]}

df = pd.DataFrame(data)

df

   gender       sport  age  height  weight
0    male      tennis   20     185      83
1  female      tennis   24     172      58
2  female  basketball   26     175      62
3    male    football   23     178      80
4  female   voleyball   22     182      65
5    male  basketball   21     196      90

In [280]:
df.groupby(['gender','sport']).mean()

                    age  height  weight
gender sport
female basketball  26.0   175.0    62.0
       tennis      24.0   172.0    58.0
       voleyball   22.0   182.0    65.0
male   basketball  21.0   196.0    90.0
       football    23.0   178.0    80.0
       tennis      20.0   185.0    83.0

In [281]:
df.pivot_table(index='gender',
               columns='sport',
               values=['age','height','weight'],
               aggfunc='mean')

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female       26.0      NaN   24.0      22.0      175.0      NaN  172.0
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0       62.0      NaN   58.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [282]:
df.pivot(index='gender',
         columns='sport',
         values=['age', 'height', 'weight'])

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female       26.0      NaN   24.0      22.0      175.0      NaN  172.0
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0       62.0      NaN   58.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [283]:
df.loc[2, "sport"] = "tennis_"
df

   gender       sport  age  height  weight
0    male      tennis   20     185      83
1  female      tennis   24     172      58
2  female     tennis_   26     175      62
3    male    football   23     178      80
4  female   voleyball   22     182      65
5    male  basketball   21     196      90

In [284]:
df.pivot_table(index='gender',
               columns='sport',
               values=['age', 'height', 'weight'],
               aggfunc='mean')

              age                                       height           \
sport  basketball football tennis tennis_ voleyball basketball football
gender
female        NaN      NaN   24.0    26.0      22.0        NaN      NaN
male         21.0     23.0   20.0     NaN       NaN      196.0    178.0

                                    weight
sport  tennis tennis_ voleyball basketball football tennis tennis_ voleyball
gender
female  172.0   175.0     182.0        NaN      NaN   58.0    62.0      65.0
male    185.0     NaN       NaN       90.0     80.0   83.0     NaN       NaN

In [285]:
df.pivot(index='gender',
         columns='sport',
         values=['age', 'height', 'weight'])

              age                                       height           \
sport  basketball football tennis tennis_ voleyball basketball football
gender
female        NaN      NaN   24.0    26.0      22.0        NaN      NaN
male         21.0     23.0   20.0     NaN       NaN      196.0    178.0

                                    weight
sport  tennis tennis_ voleyball basketball football tennis tennis_ voleyball
gender
female  172.0   175.0     182.0        NaN      NaN   58.0    62.0      65.0
male    185.0     NaN       NaN       90.0     80.0   83.0     NaN       NaN

In [286]:
df.pivot(columns='sport',
         values=['age','height','weight'])

             age                                       height                  \
sport basketball football tennis tennis_ voleyball basketball football tennis
0            NaN      NaN   20.0     NaN       NaN        NaN      NaN  185.0
1            NaN      NaN   24.0     NaN       NaN        NaN      NaN  172.0
2            NaN      NaN    NaN    26.0       NaN        NaN      NaN    NaN
3            NaN     23.0    NaN     NaN       NaN        NaN    178.0    NaN
4            NaN      NaN    NaN     NaN      22.0        NaN      NaN    NaN
5           21.0      NaN    NaN     NaN       NaN      196.0      NaN    NaN

                            weight
sport tennis_ voleyball basketball football tennis tennis_ voleyball
0         NaN       NaN        NaN      NaN   83.0     NaN       NaN
1         NaN       NaN        NaN      NaN   58.0     NaN       NaN
2       175.0       NaN        NaN      NaN    NaN    62.0       NaN
3         NaN       NaN        NaN     80.0    NaN     NaN       NaN
4         NaN     182.0        NaN      NaN    NaN     NaN      65.0
5         NaN       NaN       90.0      NaN    NaN     NaN       NaN

In [287]:
df.pivot_table(index=['gender', 'sport'],
               values=['age','height','weight'],
               aggfunc='mean')

                   age  height  weight
gender sport
female tennis       24     172      58
       tennis_      26     175      62
       voleyball    22     182      65
male   basketball   21     196      90
       football     23     178      80
       tennis       20     185      83

In [288]:
df["status"] = ["professional", 
                "professional",
                "professional", 
                "amateur", 
                "amateur",
                "amateur"]
df

   gender       sport  age  height  weight        status
0    male      tennis   20     185      83  professional
1  female      tennis   24     172      58  professional
2  female     tennis_   26     175      62  professional
3    male    football   23     178      80       amateur
4  female   voleyball   22     182      65       amateur
5    male  basketball   21     196      90       amateur

In [289]:
df.pivot_table(index=['gender', 'sport'],
               columns="status",
               values=['age','height','weight'],
               aggfunc='mean')

                      age               height               weight  \
status            amateur professional amateur professional amateur
gender sport
female tennis         NaN         24.0     NaN        172.0     NaN
       tennis_        NaN         26.0     NaN        175.0     NaN
       voleyball     22.0          NaN   182.0          NaN    65.0
male   basketball    21.0          NaN   196.0          NaN    90.0
       football      23.0          NaN   178.0          NaN    80.0
       tennis         NaN         20.0     NaN        185.0     NaN


status            professional
gender sport
female tennis             58.0
       tennis_            62.0
       voleyball           NaN
male   basketball          NaN
       football            NaN
       tennis             83.0

In [290]:
df_ = df.pivot_table(index=['gender', 'sport'],
                     columns="status",
                     values=['age','height','weight'],
                     aggfunc='mean')
df_

                      age               height               weight  \
status            amateur professional amateur professional amateur
gender sport
female tennis         NaN         24.0     NaN        172.0     NaN
       tennis_        NaN         26.0     NaN        175.0     NaN
       voleyball     22.0          NaN   182.0          NaN    65.0
male   basketball    21.0          NaN   196.0          NaN    90.0
       football      23.0          NaN   178.0          NaN    80.0
       tennis         NaN         20.0     NaN        185.0     NaN


status            professional
gender sport
female tennis             58.0
       tennis_            62.0
       voleyball           NaN
male   basketball          NaN
       football            NaN
       tennis             83.0

In [291]:
df_.stack(level=-1, dropna=False)

                                 age  height  weight
gender sport      status
female tennis     amateur        NaN     NaN     NaN
                  professional  24.0   172.0    58.0
       tennis_    amateur        NaN     NaN     NaN
                  professional  26.0   175.0    62.0
       voleyball  amateur       22.0   182.0    65.0
                  professional   NaN     NaN     NaN
male   basketball amateur       21.0   196.0    90.0
                  professional   NaN     NaN     NaN
       football   amateur       23.0   178.0    80.0
                  professional   NaN     NaN     NaN
       tennis     amateur        NaN     NaN     NaN
                  professional  20.0   185.0    83.0

In [292]:
df_.stack(dropna=False)

                                 age  height  weight
gender sport      status
female tennis     amateur        NaN     NaN     NaN
                  professional  24.0   172.0    58.0
       tennis_    amateur        NaN     NaN     NaN
                  professional  26.0   175.0    62.0
       voleyball  amateur       22.0   182.0    65.0
                  professional   NaN     NaN     NaN
male   basketball amateur       21.0   196.0    90.0
                  professional   NaN     NaN     NaN
       football   amateur       23.0   178.0    80.0
                  professional   NaN     NaN     NaN
       tennis     amateur        NaN     NaN     NaN
                  professional  20.0   185.0    83.0

In [293]:
df_.unstack(level=0)

               age                           height                      \
status     amateur       professional       amateur        professional
gender      female  male       female  male  female   male       female
sport
basketball     NaN  21.0          NaN   NaN     NaN  196.0          NaN
football       NaN  23.0          NaN   NaN     NaN  178.0          NaN
tennis         NaN   NaN         24.0  20.0     NaN    NaN        172.0
tennis_        NaN   NaN         26.0   NaN     NaN    NaN        175.0
voleyball     22.0   NaN          NaN   NaN   182.0    NaN          NaN

                   weight
status            amateur       professional
gender       male  female  male       female  male
sport
basketball    NaN     NaN  90.0          NaN   NaN
football      NaN     NaN  80.0          NaN   NaN
tennis      185.0     NaN   NaN         58.0  83.0
tennis_       NaN     NaN   NaN         62.0   NaN
voleyball     NaN    65.0   NaN          NaN   NaN

In [294]:
df_.unstack(level=0, fill_value="-")

               age                           height                      \
status     amateur       professional       amateur        professional
gender      female  male       female  male  female   male       female
sport
basketball       -  21.0            -   NaN       -  196.0            -
football         -  23.0            -   NaN       -  178.0            -
tennis         NaN   NaN         24.0  20.0     NaN    NaN        172.0
tennis_        NaN     -         26.0     -     NaN      -        175.0
voleyball     22.0     -          NaN     -   182.0      -          NaN

                   weight
status            amateur       professional
gender       male  female  male       female  male
sport
basketball    NaN       -  90.0            -   NaN
football      NaN       -  80.0            -   NaN
tennis      185.0     NaN   NaN         58.0  83.0
tennis_         -     NaN     -         62.0     -
voleyball       -    65.0     -          NaN     -